In [1]:
#set necessary libraries
import pandas as pd
import sqlalchemy
import sqlite3 as sq
from sqlalchemy import create_engine
from flask import jsonify
import config
import os

In [2]:
#we need to set our database credentials
# if another user is using file, they will need to create their own config.py file locally with address to postgres db
    
print(config.url)

postgres://jincgnemrccala:8d89aa468b157c4377d9a9488cc121f42fd08b5efca2bcef03dab6a9aedf09df@ec2-54-235-86-101.compute-1.amazonaws.com:5432/d8eoiti175ci0a

In [3]:
#create engine
engine = sqlalchemy.create_engine(config.url)

#connect to our server

conn = engine.connect()

In [4]:
#we need to read our csv files
combined_file = "data/Combined_Data.csv"
gdp_file = "data/GDP_Data.csv"
population_file= "data/Population_Data.csv"
netmigration_file = "data/Net_Migration_Data.csv"
life_file = "data/Life_Expectancy_Data.csv"

In [5]:
#create a dataframe for combined
combined_df = pd.read_csv(combined_file)
combined_df.head()

,Index,CountryName,CountryCode,1960,1961,1962,1963,1964,1965,1966,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,GDP per capita,Aruba,ABW,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,27086.039850,24630.939270,23512.602600,24984.27945,24709.60226,25018.308950,25528.403780,25796.380250,25251.63968,25655.102020
1,Life expectancy,Aruba,ABW,65.662000,66.074000,66.444000,66.787000,67.113000,67.435000,67.762000,...,74.725000,74.872000,75.016000,75.15800,75.29900,75.440000,75.582000,75.725000,75.86700,76.010000
2,Net migration,Aruba,ABW,NaN,NaN,-4323.000000,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1253.00000,NaN,NaN,NaN,NaN,1004.000000
3,Population,Aruba,ABW,54211.000000,55438.000000,56225.000000,56695.000000,57032.000000,57360.000000,57715.000000,...,101353.000000,101453.000000,101669.000000,102053.00000,102577.00000,103187.000000,103795.000000,104341.000000,104822.00000,105264.000000
4,GDP per capita,Afghanistan,AFG,59.777327,59.878153,58.492874,78.782758,82.208444,101.290471,137.899362,...,370.382294,444.184404,550.514974,599.29763,648.51107,647.966461,625.339539,590.076474,549.58276,550.068459

In [9]:
#create a dataframe for gdp
gdp_df = pd.read_csv(gdp_file)
gdp_df.head()

,Series Name,Country Name,Country Code,1960,1961,1962,1963,1964,1965,1966,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,GDP per capita,Afghanistan,AFG,59.777327,59.878153,58.492874,78.782758,82.208444,101.290471,137.899362,...,370.382294,444.184404,550.514974,599.297630,648.511070,647.966461,625.339539,590.076474,549.582760,550.068459
1,GDP per capita,Albania,ALB,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,4370.539925,4114.134899,4094.360204,4437.177794,4247.614342,4413.082887,4578.667934,3952.830781,4131.872341,4537.579056
2,GDP per capita,Algeria,DZA,244.824806,213.485905,171.209810,225.530596,236.610190,248.378144,234.188908,...,4905.254866,3868.831230,4463.394675,5432.413320,5565.134521,5471.123389,5466.425778,4162.852181,3943.497550,4055.247211
3,GDP per capita,American Samoa,ASM,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,9871.997194,12058.263820,10352.822760,10375.994220,11660.329530,11589.853000,11598.751740,11901.975260,11744.815550,11394.475300
4,GDP per capita,Andorra,AND,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,47785.659090,43339.379870,39736.354060,41098.766940,38391.080870,40619.711300,42294.994730,36038.267600,37231.815670,39146.548840

In [10]:
#create a dataframe for net migration
netmigration_df = pd.read_csv(netmigration_file)
netmigration_df.head()

,Series Name,Country Name,Country Code,1960,1961,1962,1963,1964,1965,1966,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Net migration,Afghanistan,AFG,NaN,NaN,-20000.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,448007.0,NaN,NaN,NaN,NaN,-299999.0
1,Net migration,Albania,ALB,NaN,NaN,-99.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,-93425.0,NaN,NaN,NaN,NaN,-40000.0
2,Net migration,Algeria,DZA,NaN,NaN,-284266.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,-143268.0,NaN,NaN,NaN,NaN,-50002.0
3,Net migration,American Samoa,ASM,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Net migration,Andorra,AND,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
#create a dataframe for population
pop_df = pd.read_csv(population_file)
pop_df.head()

,Series Name,Country Name,Country Code,1960,1961,1962,1963,1964,1965,1966,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Population,Afghanistan,AFG,8996351.0,9166764.0,9345868.0,9533954.0,9731361.0,9938414.0,10152331.0,...,27294031.0,28004331.0,28803167.0,29708599.0,30696958.0,31731688.0,32758020.0,33736494.0,34656032.0,35530081.0
1,Population,Albania,ALB,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,1864791.0,1914573.0,...,2947314.0,2927519.0,2913021.0,2905195.0,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,2873457.0
2,Population,Algeria,DZA,11124888.0,11404859.0,11690153.0,11985136.0,12295970.0,12626952.0,12980267.0,...,34860715.0,35465760.0,36117637.0,36819558.0,37565847.0,38338562.0,39113313.0,39871528.0,40606052.0,41318142.0
3,Population,American Samoa,ASM,20013.0,20486.0,21117.0,21882.0,22698.0,23520.0,24321.0,...,57030.0,56227.0,55637.0,55320.0,55230.0,55307.0,55437.0,55537.0,55599.0,55641.0
4,Population,Andorra,AND,13411.0,14375.0,15370.0,16412.0,17469.0,18549.0,19647.0,...,83861.0,84462.0,84449.0,83751.0,82431.0,80788.0,79223.0,78014.0,77281.0,76965.0

In [12]:
#create a dataframe for life expectancy
life_df = pd.read_csv(life_file)
life_df.head()

,Series Name,Country Name,Country Code,1960,1961,1962,1963,1964,1965,1966,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Life expectancy,Afghanistan,AFG,32.292,32.742,33.185,33.624,34.060,34.495,34.928,...,60.243,60.754,61.226,61.666,62.086,62.494,62.895,63.288,63.673,64.047
1,Life expectancy,Albania,ALB,62.279,63.298,64.187,64.911,65.461,65.848,66.108,...,75.943,76.281,76.652,77.031,77.389,77.702,77.963,78.174,78.345,78.495
2,Life expectancy,Algeria,DZA,46.138,46.596,47.054,47.507,47.956,48.392,48.809,...,74.032,74.374,74.676,74.944,75.187,75.418,75.641,75.860,76.078,76.293
3,Life expectancy,American Samoa,ASM,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Life expectancy,Andorra,AND,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
#we need to upload our combined dataframe to Posgres SQL table in Heroku
combined_df.to_sql(name="world_indices",con=engine, if_exists = 'replace', index_label='id')

In [14]:
#we need to add a primary key to our file, otherwise our automap_base() will not work
with engine.connect() as con:
    con.execute('ALTER TABLE world_indices ADD PRIMARY KEY (id);')

In [15]:
#we need to upload our gdp dataframe to Posgres SQL table in Heroku
gdp_df.to_sql(name="world_gdp",con=engine, if_exists = 'replace', index_label='id')

In [16]:
#we need to add a primary key to our file, otherwise our automap_base() will not work
with engine.connect() as con:
    con.execute('ALTER TABLE world_gdp ADD PRIMARY KEY (id);')

In [17]:
#we need to upload our netmigration dataframe to Posgres SQL table in Heroku
netmigration_df.to_sql(name="world_netmigration",con=engine, if_exists = 'replace', index_label='id')

In [18]:
#we need to add a primary key to our file, otherwise our automap_base() will not work
with engine.connect() as con:
    con.execute('ALTER TABLE world_netmigration ADD PRIMARY KEY (id);')

In [19]:
#we need to upload our  dataframe to Posgres SQL table in Heroku
pop_df.to_sql(name="world_population",con=engine, if_exists = 'replace', index_label='id')

In [20]:
#we need to add a primary key to our file, otherwise our automap_base() will not work
with engine.connect() as con:
    con.execute('ALTER TABLE world_population ADD PRIMARY KEY (id);')

In [21]:
#we need to upload our  dataframe to Posgres SQL table in Heroku
life_df.to_sql(name="life_table",con=engine, if_exists = 'replace', index_label='id')

In [22]:
#we need to add a primary key to our file, otherwise our automap_base() will not work
with engine.connect() as con:
    con.execute('ALTER TABLE life_table ADD PRIMARY KEY (id);')

In [ ]:
#read our data
netmigration_table = pd.read_sql_table(table_name='world_netmigration', con=engine)
netmigration_table.head()

In [ ]:
#check datatypes and see that the column years are objects 
# netmigration_table.dtypes

In [ ]:
#create a list comprehension for the range for values, need to make sure range captures all the years
years_columns =[str(x) for x in (range(1960,2018))]

In [ ]:
#using pandas pivot to make better organize our original data
netmigration_pivot = pd.pivot_table(netmigration_table, values=years_columns, index= ['Country Name'], columns=["Series Name"])
netmigration_pivot.head()

In [ ]:
# use code below to create new columns that combine multi index
final_netcolumns = [' '.join(col).strip() for col in netmigration_pivot.columns.values]
# final_netcolumns

In [ ]:
#set our new table columns to the final columns created above, and set to json
netmigration_pivot.columns= final_netcolumns
netmigration_pivot.head()

In [ ]:
#json data for net migration
netmigration_pivot.reset_index().to_json(orient='records')

In [ ]:
#read our data
gdp_table = pd.read_sql_table(table_name='world_gdp', con=engine)
gdp_table.head()

In [ ]:
#using pandas pivot to make better organize our original data
gdp_pivot = pd.pivot_table(gdp_table, values=years_columns, index= ['Country Name'], columns=["Series Name"])
gdp_pivot.head()

In [ ]:
# use code below to create new columns that combine multi index
final_gdpcolumns = [' '.join(col).strip() for col in gdp_pivot.columns.values]
# final_gdpcolumns

In [ ]:
#set our new table columns to the final columns created above, and set to json
gdp_pivot.columns= final_gdpcolumns
gdp_pivot.head()

In [ ]:
#json data for gdp pivot
gdp_pivot.reset_index().to_json(orient='records')

In [ ]:
#read our data
combined_table = pd.read_sql_table(table_name='world_indices', con=engine)
combined_table.head()

In [ ]:
combined_table.dtypes

In [ ]:
#create a list comprehension for the range for values, need to make sure range captures all the years
years_columns =[str(x) for x in (range(1960,2018))]
# years_columns

In [ ]:
#using pandas pivot to make better organize our original data
new_combinedtable = pd.pivot_table(combined_table, values=years_columns, index= ['CountryName'], columns=["Index"])
new_combinedtable.head()

In [ ]:
# use code below to create new columns that combine multi index
final_columns = [' '.join(col).strip() for col in new_combinedtable.columns.values]
# final_columns

In [ ]:
#set our new table columns to the final columns created above, and set to json
new_combinedtable.columns= final_columns
new_combinedtable.head()
# return new_table.reset_index().to_json(orient='records')

In [ ]:
new_combinedtable.reset_index().to_json(orient='records')